app/Services/ArchivoService.php

    private function guardarArchivo($file): int
    {
        $extension = strtolower($file->getClientExtension());
        $nombre = $file->getRandomName();

        if (!$file->move(self::RUTA_UPLOADS, $nombre)) {
            throw new \Exception('Error al guardar el archivo en el servidor');
        }

        $idArchivo = $this->archivoModel->insert([
            'nombre_archivo' => $file->getClientName(),
            'ruta' => self::RUTA_UPLOADS . '/' . $nombre,
            'formato' => $extension,
        ]);
---
INSERT INTO `archivo` (`nombre_archivo`, `ruta`, `formato`) VALUES ('Mesa Regular 18-12-25.pdf', './uploads/archivos/1778182885_bc1766fe9000e47b5ebc.pdf', 'pdf')