app/Services/PagoService.php

    public function verificarPagoExistente(string $dni, int $idPublicacion): bool
    {
        $db = \Config\Database::connect();
        $resultado = $db->table('pago')
                        ->where('dni_usuario', $dni)
                        ->where('id_publicacion', $idPublicacion)
                        ->get()
                        ->getRow();
---
SELECT *
FROM `pago`
WHERE `dni_usuario` = '22333444'
AND `id_publicacion` = 10

    public function registrarNuevoPago(string $dni, int $idPublicacion, float $monto): bool
    {
        $db = \Config\Database::connect();
        return $db->table('pago')->insert([
            'dni_usuario'    => $dni,
            'id_publicacion' => $idPublicacion,
            'fecha_pago'     => date('Y-m-d'),
            'monto'          => $monto
        ]);
---
INSERT INTO `pago` (`dni_usuario`, `id_publicacion`, `fecha_pago`, `monto`) VALUES ('22333444', 32, '2026-06-09', 5000)