app/Services/PublicacionService.php

SELECT `publicacion`.*, `m`.`nombre_materia`, `a`.`nombre_archivo` as `file_name`, `a`.`ruta`, `a`.`formato`
FROM `publicacion`
LEFT JOIN `materia` `m` ON `m`.`id_materia` = `publicacion`.`id_materia`
LEFT JOIN `archivo` `a` ON `a`.`id_archivo` = `publicacion`.`id_archivo`
WHERE `publicacion`.`dni_usuario` = '10200300'
ORDER BY `publicacion`.`fecha_publicacion` DESC
---
    public function obtenerPublicacionesUsuario(string $dni, bool $soloActivas = true): array
    {
        $builder = $this->publicacionModel->builder();

        $builder->select('publicacion.*, m.nombre_materia, a.nombre_archivo as file_name, a.ruta, a.formato');

        $builder->join('materia m', 'm.id_materia = publicacion.id_materia', 'left');
        $builder->join('archivo a', 'a.id_archivo = publicacion.id_archivo', 'left');

        $builder->where('publicacion.dni_usuario', $dni);

        if ($soloActivas) {
            $builder->where('publicacion.estado', 1);
        }

        $builder->orderBy('publicacion.fecha_publicacion', 'DESC');

        return $builder->get()->getResultArray();

SELECT `publicacion`.*, `a`.`nombre_archivo` as `file_name`, `a`.`ruta`
FROM `publicacion`
LEFT JOIN `archivo` `a` ON `a`.`id_archivo` = `publicacion`.`id_archivo`
WHERE `publicacion`.`id_publicacion` = 11
---
    public function obtenerPublicacionPorId(int $id): ?array
    {
       $builder = $this->publicacionModel->builder();

        $builder->select('publicacion.*, m.nombre_materia, a.nombre_archivo as file_name, a.ruta, a.formato');

        $builder->join('archivo a', 'a.id_archivo = publicacion.id_archivo', 'left');

        $builder->where('publicacion.id_publicacion', $id);
        return $builder->get()->getRowArray();

INSERT INTO `publicacion` (`titulo`, `descripcion`, `id_materia`, `tipo_recurso`, `tipo_acuerdo`, `precio`, `dni_usuario`, `id_archivo`, `fecha_publicacion`, `estado`) VALUES ('Modelo de examen final', 'Es un modelo de mesa de examen del año 2025', 3, 'examen', 'gratis', 0, '22333444', 14, '2026-05-07', 1)
---
    private function guardarPublicacion(array $data)
    {
        $resultado = $this->publicacionModel->insert($data);