app/Services/PublicacionService.php

SELECT *
FROM `formato`
WHERE `slug` = 'pdf'
---
    public function procesarPublicacion(array $datos, $archivo, $imagenPortada, string $dniUsuario)
    {
        // Agregamos el DNI del usuario a los datos para una validación centralizada
        $datos['dni_usuario'] = $dniUsuario;
        $this->validarDatos($datos, true); // true indica que es una creación

        // El archivo a usar como principal. Por defecto, el 'archivo'.
        $archivoPrincipal = $archivo;

        // Si no se subió un 'archivo' pero sí una 'imagen_portada', usamos la imagen como principal.
        if ((!$archivo || !$archivo->isValid()) && ($imagenPortada && $imagenPortada->isValid())) {
            $archivoPrincipal = $imagenPortada;
            // Forzamos el formato a 'imagen' para que la validación y el guardado sean coherentes.
            $datos['formato_archivo'] = 'imagen';
        }

        // NUEVA VALIDACIÓN: Coherencia entre formato y archivo
        $this->validarCoherenciaFormatoArchivo($datos, $archivoPrincipal);

        $idArchivo = null;

        // Un archivo solo es requerido si no es un libro físico
        $esLibroFisico = isset($datos['formato_archivo']) && $datos['formato_archivo'] === 'fisico';

        if ($archivoPrincipal && $archivoPrincipal->isValid()) {
            $formatoSlug = $datos['formato_archivo'] ?? null;
            if (empty($formatoSlug)) {
                throw new \Exception("Debe seleccionar un formato para el material.");
            }

            $formatoRow = $this->db->table('formato')->where('slug', $formatoSlug)->get()->getRow();

SELECT `publicacion`.*, `m`.`nombre_materia`, `a`.`nombre_archivo` as `file_name`, `a`.`ruta`, `f`.`nombre_formato` AS `formato`, `f`.`slug` AS `formato_slug`
FROM `publicacion`
LEFT JOIN `materia` `m` ON `m`.`id_materia` = `publicacion`.`id_materia`
LEFT JOIN `archivo` `a` ON `a`.`id_archivo` = `publicacion`.`id_archivo`
LEFT JOIN `formato` `f` ON `f`.`id_formato` = `a`.`id_formato`
WHERE `publicacion`.`id_publicacion` = 32
---
    public function obtenerPublicacionPorId(int $id): ?array
    {
       $builder = $this->publicacionModel->builder();

        // CORREGIDO: Unir con la tabla 'formato' para obtener el nombre del formato
        $builder->select('publicacion.*, m.nombre_materia, a.nombre_archivo as file_name, a.ruta, f.nombre_formato AS formato, f.slug AS formato_slug');

        $builder->join('materia m', 'm.id_materia = publicacion.id_materia', 'left');

        $builder->join('archivo a', 'a.id_archivo = publicacion.id_archivo', 'left');
        $builder->join('formato f', 'f.id_formato = a.id_formato', 'left'); // NUEVO JOIN

        $builder->where('publicacion.id_publicacion', $id);
        return $builder->get()->getRowArray();

SELECT *
FROM `tipo_recurso`
WHERE `slug` = 'resumen'
---
    private function construirPublicacion(array $datos, $idArchivo)
    {
        // Obtener el ID del tipo de recurso a partir de su slug
        $tipoRecursoSlug = $datos['tipo_recurso'] ?? null;
        $tipoRecursoRow = $this->db->table('tipo_recurso')->where('slug', $tipoRecursoSlug)->get()->getRow();

INSERT INTO `publicacion` (`titulo`, `descripcion`, `id_materia`, `id_tipo_recurso`, `tipo_acuerdo`, `precio`, `dni_usuario`, `id_archivo`, `fecha_publicacion`, `estado`) VALUES ('Teoría completa', 'Este archivo es un apunte teórico completo y estructurado para la materia Base de Datos 1 (BD 1) de la carrera de Licenciatura en Sistemas de la Información (LSI) en FaCENA UNNE. Fue elaborado por Kevin Emiliano Garay en el año 2024.', 3, 1, 'pago', 6000, 22333444, 43, '2026-06-09', 1)
---
    private function guardarPublicacion(array $data)
    {
        // Se usa el Query Builder directamente para evitar problemas con la propiedad $allowedFields del modelo,
        // que puede causar fallos silenciosos si no está correctamente configurada.
        $resultado = $this->db->table('publicacion')->insert($data);