app/Controllers/ApiController.php

SELECT *
FROM `tipo_recurso`
ORDER BY `nombre_tipo` ASC
---
    public function tipos_recurso()
    {
        $db = \Config\Database::connect();
        $data = $db->table('tipo_recurso')->orderBy('nombre_tipo', 'ASC')->get()->getResultArray();

SELECT *
FROM `formato`
ORDER BY `id_formato` ASC
---
    public function formatos()
    {
        $db = \Config\Database::connect();
        $data = $db->table('formato')->orderBy('id_formato', 'ASC')->get()->getResultArray();