app/Controllers/AuthController.php

SELECT *
FROM `usuario`
WHERE `usuario`.`dni_usuario` = '99888777'
---
    public function login($source = 'web')
    {
        // El parámetro $source se utiliza para registrar el origen del intento de login.
        log_message('info', 'Intento de login desde la fuente: ' . $source);

        $dni = $this->request->getPost('dni');
        $password = $this->request->getPost('password');

        $usuarioModel = new UsuarioModel();
        $usuario = $usuarioModel->find($dni);