app/Controllers/Home.php

public function publicaciones() {
    if(!session()->get('isLoggedIn')) return redirect()->to('/');

    $dni = session()->get('usuario')['dni_usuario'];
    $db = \Config\Database::connect();


    $builder = $db->table('publicacion p');
    $builder->select('p.*, m.nombre_materia, a.nombre_archivo as file_name, a.ruta');
     $builder->join('materia m', 'm.id_materia = p.id_materia', 'left');
    $builder->join('archivo a', 'a.id_archivo = p.id_archivo', 'left');

    $builder->where('p.dni_usuario', $dni);

    $mis_publicaciones = $builder ->get()->getResultArray();
---
SELECT `p`.*, `m`.`nombre_materia`, `a`.`nombre_archivo` as `file_name`, `a`.`ruta`
FROM `publicacion` `p`
LEFT JOIN `materia` `m` ON `m`.`id_materia` = `p`.`id_materia`
LEFT JOIN `archivo` `a` ON `a`.`id_archivo` = `p`.`id_archivo`
WHERE `p`.`dni_usuario` = '33444555'